# В городе M расположена кольцевая автодорога длиной в N километров с движением в обе стороны.
# На каждом километре автодороги расположены пункты приема мусора определенной вместимости.
# В пределах кольцевой дороги в одном из пунктов сборки мусора собираются поставить мусороперерабатывающий завод таким образом,
# чтобы стоимость доставки мусора была минимальной. Стоимость доставки мусора вычисляется как вместимость пункта сбора,
# умноженная на расстояние от пункта сбора мусора до мусороперерабатывающего завода.
# Если мусороперерабатывающий завод находится рядом с пунктом сбора, расстояние считается нулевым.
# Пункты сбора мусора нумеруются с 1 до N. Рядом с каким пунктом сбора мусора нужно поставить мусороперерабатывающий завод?